# DimStyleFlippedDimLineExtension Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimStyleFlippedDimLineExtension Property
ParameterTypeId Class See Also
---
"Flipped Dimension Line Extension"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimStyleFlippedDimLineExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimStyleFlippedDimLineExtension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimStyleFlippedDimLineExtension {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace